In [2]:
# arrays and functions
import numpy as np
# create and manipulate datasets
import pandas as pd

In [3]:
med_price_list = [55,25,75,40,90]

In [4]:
med_price_arr = np.array(med_price_list)

In [5]:
series_list = pd.Series(med_price_list)
series_list

0    55
1    25
2    75
3    40
4    90
dtype: int64

In [6]:
series_arr = pd.Series(med_price_arr)
series_arr
index = ['Omeprazole','Azithromycin','Metformin','Ibuprofen','Cetrizine']

In [7]:
med_price_list_labeled = pd.Series(med_price_list)
med_price_list_labeled

0    55
1    25
2    75
3    40
4    90
dtype: int64

In [8]:
med_price_list_labeled = med_price_list_labeled + 2
med_price_list_labeled

0    57
1    27
2    77
3    42
4    92
dtype: int64

In [9]:
students = ['Mary','Peter','Susan','Toby','Vishal']
df1 = pd.DataFrame(students, columns=['Student'])
df1

  Student
0    Mary
1   Peter
2   Susan
3    Toby
4  Vishal

In [10]:
grades = ['B-','A+','A-','B+','C']
df2 = pd.DataFrame({'Students':students,'Grades':grades})
df2

  Students Grades
0     Mary     B-
1    Peter     A+
2    Susan     A-
3     Toby     B+
4   Vishal      C

In [11]:
df3 = pd.DataFrame({'Medicine':index,'Prices':med_price_list_labeled})
df3

       Medicine  Prices
0    Omeprazole      57
1  Azithromycin      27
2     Metformin      77
3     Ibuprofen      42
4     Cetrizine      92

In [12]:
df4 = pd.DataFrame(np.random.randn(5,2),columns=['Trail 1','Trail 2'])
df4

    Trail 1   Trail 2
0 -0.521473  3.257053
1 -0.993866  0.706061
2  0.699615  0.564076
3 -1.084663 -0.325762
4  0.558645  0.284386